renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_s12ad_rx660.c
* Description  : Primary source code for 12-bit A/D Converter driver.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*           29.12.2021 1.00    Initial Release.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include <stdio.h>
#include "platform.h"

#if defined (BSP_MCU_RX660)
#include "r_s12ad_rx_config.h"
#include "r_s12ad_rx_private.h"
#include "r_s12ad_rx_if.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

#define ADC_PRV_GRPBL1_S12CMPIA0_FLAG    (1<<20)
#define ADC_PRV_GRPBL1_S12CMPIB0_FLAG    (1<<21)

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
/* Unit2 registers are a superset of Unit0, 1 EXCEPT that they do not contain the S&H registers and the PGA registers */
typedef R_BSP_VOLATILE_EVENACCESS struct st_s12ad   aregs_t;

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
/* In RAM */

adc_ctrl_t g_dcb = {ADC_MODE_MAX,
                    NULL,
                    false,
                    ADC_PRV_GRPBL1_S12CMPIA0_FLAG,
                    ADC_PRV_GRPBL1_S12CMPIB0_FLAG,
                   };

/* In ROM. A/D Data Register pointers */

volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg_ptrs[ADC_REG_MAX+1] =
                    {   &S12AD.ADDR0,       /* channel 0 */
                        &S12AD.ADDR1,       /* channel 1 */
                        &S12AD.ADDR2,       /* channel 2 */
                        &S12AD.ADDR3,       /* channel 3 */
                        &S12AD.ADDR4,       /* channel 4 */
                        &S12AD.ADDR5,       /* channel 5 */
                        &S12AD.ADDR6,       /* channel 6 */
                        &S12AD.ADDR7,       /* channel 7 */
                        &S12AD.ADDR8,       /* channel 8 */
                        &S12AD.ADDR9,       /* channel 9 */
                        &S12AD.ADDR10,      /* channel 10 */
                        &S12AD.ADDR11,      /* channel 11 */
                        &S12AD.ADDR12,      /* channel 12 */
                        &S12AD.ADDR13,      /* channel 13 */
                        &S12AD.ADDR14,      /* channel 14 */
                        &S12AD.ADDR15,      /* channel 15 */
                        &S12AD.ADDR16,      /* channel 16 */
                        &S12AD.ADDR17,      /* channel 17 */
                        &S12AD.ADDR18,      /* channel 18 */
                        &S12AD.ADDR19,      /* channel 19 */
                        &S12AD.ADDR20,      /* channel 20 */
                        &S12AD.ADDR21,      /* channel 21 */
                        &S12AD.ADDR22,      /* channel 22 */
                        &S12AD.ADDR23,      /* channel 23 */
                        &S12AD.ADTSDR,      /* temperature sensor */
                        &S12AD.ADOCDR,      /* voltage sensor */
                        &S12AD.ADDBLDR,     /* double trigger register */
                        &S12AD.ADDBLDRA,    /* double trigger registerA */
                        &S12AD.ADDBLDRB,    /* double trigger registerB */
                        &S12AD.ADRD.WORD    /* self-diagnosis register */
                    };

