renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
    /* A/D Control Register initialize */
    p_regs->ADCSR.WORD = 0;

    /* A/D Channel Select Register A0 initialize */
    p_regs->ADANSA0.WORD = 0;

    /* A/D-Converted Value Addition/Average Function Select Register 0 initialize */
    p_regs->ADADS0.WORD = 0;

    /* A/D-Converted Value Addition/Average Count Select Register initialize */
    p_regs->ADADC.BYTE = 0;

    /* A/D Control Extended Register initialize */
    p_regs->ADCER.WORD = 0;

    /* A/D Conversion Start Trigger Select Register initialize */
    p_regs->ADSTRGR.WORD = 0;

    /* A/D Channel Select Register B0 initialize */
    p_regs->ADANSB0.WORD = 0;

    /* A/D Disconnection Detection Control Register initialize */
    p_regs->ADDISCR.BYTE = 0;

    /* A/D Event Link Control Register initialize */
    p_regs->ADELCCR.BYTE = 0;

    /* A/D Group Scan Priority Control Register initialize */
    p_regs->ADGSPCR.WORD = 0;

    /* A/D Comparison Function Control Register initialize */
    p_regs->ADCMPCR.WORD = 0;

    /* A/D Comparison Function Window A Channel Select Register 0 initialize */
    p_regs->ADCMPANSR0.WORD = 0;

    /* A/D Comparison Function Window A Comparison Condition Setting Register 0 initialize */
    p_regs->ADCMPLR0.WORD = 0;

    /* A/D Comparison Function Window A Lower Level Setting Register initialize */
    p_regs->ADCMPDR0 = 0;

    /* A/D Comparison Function Window A Upper Level Setting Register initialize */
    p_regs->ADCMPDR1 = 0;

    /* A/D Comparison Function Window A Channel Status Register 0 initialize */
    u16_dummy = p_regs->ADCMPSR0.WORD;
    p_regs->ADCMPSR0.WORD = 0;

    /* A/D Comparison Function Window B Channel Select Register initialize */
    p_regs->ADCMPBNSR.BYTE = 0;

    /* A/D Comparison Function Window B Lower Level Setting Register initialize */
    p_regs->ADWINLLB = 0;

    /* A/D Comparison Function Window B Upper Level Setting Register initialize */
    p_regs->ADWINULB = 0;

    /* A/D Comparison Function Window B Channel Status Register initialize */
    u8_dummy = p_regs->ADCMPBSR.BYTE;
    p_regs->ADCMPBSR.BYTE = 0;

    /* A/D Channel Select Register C0 initialize */
    p_regs->ADANSC0.WORD = 0;

    /* A/D Group C Trigger Select Register initialize */
    p_regs->ADGCTRGR.BYTE = 0;

    /* A/D Sampling State Register initialize */
    p_regs->ADSSTR0 = 0x1B;
    p_regs->ADSSTR1 = 0x1B;
    p_regs->ADSSTR2 = 0x1B;
    p_regs->ADSSTR3 = 0x1B;
    p_regs->ADSSTR4 = 0x1B;
    p_regs->ADSSTR5 = 0x1B;
    p_regs->ADSSTR6 = 0x1B;
    p_regs->ADSSTR7 = 0x1B;
    p_regs->ADSSTR8 = 0x1B;
    p_regs->ADSSTR9 = 0x1B;
    p_regs->ADSSTR10 = 0x1B;
    p_regs->ADSSTR11 = 0x1B;
    p_regs->ADSSTR12 = 0x1B;
    p_regs->ADSSTR13 = 0x1B;
    p_regs->ADSSTR14 = 0x1B;
    p_regs->ADSSTR15 = 0x1B;
    p_regs->ADSSTRL = 0x1B;
    p_regs->ADSSTRT = 0x1B;
    p_regs->ADSSTRO = 0x1B;
    if (0 != S12AD.ADSSTRO)
    {

        /* Dommy read and compare */
        R_BSP_NOP();
    }
    /* A/D Channel Conversion Order Setting Register initialize */
    p_regs->ADSCS0 = 0x00;
    p_regs->ADSCS1 = 0x01;
    p_regs->ADSCS2 = 0x02;
    p_regs->ADSCS3 = 0x03;
    p_regs->ADSCS4 = 0x04;
    p_regs->ADSCS5 = 0x05;
    p_regs->ADSCS6 = 0x06;
    p_regs->ADSCS7 = 0x07;
    p_regs->ADSCS8  = 0x08;
    p_regs->ADSCS9  = 0x09;
    p_regs->ADSCS10 = 0x0A;
    p_regs->ADSCS11 = 0x0B;
    p_regs->ADSCS12 = 0x0C;
    p_regs->ADSCS13 = 0x0D;
    p_regs->ADSCS14 = 0x0E;
    p_regs->ADSCS15 = 0x0F;
    p_regs->ADSCS16 = 0x10;
    p_regs->ADSCS17 = 0x11;
    p_regs->ADSCS18 = 0x12;
    p_regs->ADSCS19 = 0x13;
    p_regs->ADSCS20 = 0x14;
    p_regs->ADSCS21 = 0x15;
    p_regs->ADSCS22 = 0x16;
    p_regs->ADSCS23 = 0x17;


    /* A/D Channel Select Register A1 initialize */
    S12AD.ADANSA1.WORD = 0;

    /* A/D-Converted Value Addition/Average Function Select Register 1 initialize */
    S12AD.ADADS1.WORD = 0;

    /* A/D Conversion Extended Input Control Register initialize */
    S12AD.ADEXICR.WORD = 0;

    /* A/D Channel Select Register B1 initialize */
    S12AD.ADANSB1.WORD = 0;

    /* A/D Comparison Function Window A Extended Input Select Register initialize */
    S12AD.ADCMPANSER.BYTE = 0;

    /* A/D Comparison Function Window A Extended Input Comparison Condition
       Setting Register initialize */
    S12AD.ADCMPLER.BYTE = 0;

    /* A/D Comparison Function Window A Channel Select Register 1 initialize */
    S12AD.ADCMPANSR1.WORD = 0;

    /* A/D Comparison Function Window A Comparison Condition Setting Register 1 initialize */
    S12AD.ADCMPLR1.WORD = 0;

    /* A/D Comparison Function Window A Channel Status Register 1 initialize */
    u16_dummy = S12AD.ADCMPSR1.WORD;
    S12AD.ADCMPSR1.WORD = 0;

    /* A/D Comparison Function Window A Extended Input Channel Status Register initialize */
    u8_dummy = S12AD.ADCMPSER.BYTE;
    S12AD.ADCMPSER.BYTE = 0;

    /* A/D Channel Select Register C1 initialize */
    S12AD.ADANSC1.WORD = 0;

    /* A/D Group C Extended Input Control Register */
    S12AD.ADGCEXCR.BYTE = 0;

    /* A/D Sampling State Register initialize */
    S12AD.ADSSTRL = 0x1B;
    S12AD.ADSSTRT = 0x1B;
    S12AD.ADSSTRO = 0x1B;
    S12AD.ADSSTR8 = 0x1B;
    S12AD.ADSSTR9 = 0x1B;
    S12AD.ADSSTR10 = 0x1B;
    S12AD.ADSSTR11 = 0x1B;
    if (0 != S12AD.ADSSTR11)
    {

        /* Dummy read and compare */
        R_BSP_NOP();
    }

    /* A/D Channel Conversion Order Setting Register initialize */
    S12AD.ADSCS8  = 0x08;
    S12AD.ADSCS9  = 0x09;
    S12AD.ADSCS10 = 0x0A;
    S12AD.ADSCS11 = 0x0B;
    S12AD.ADSCS12 = 0x10;
    S12AD.ADSCS13 = 0x11;

    /* A/D Internal Reference Voltage Monitoring Circuit Enable Register initialize */
    S12AD.ADVMONCR.BYTE = 0;

    /* A/D Internal Reference Voltage Monitoring Circuit Output Enable Register initialize */
    S12AD.ADVMONO.BYTE = 0;

    /* SET TEMPERATURE SENSOR */
    if (ADC_TEMP_SENSOR_NOT_AD_CONVERTED != p_cfg->temp_sensor)
    {
        if (ADC_TEMP_SENSOR_AD_CONVERTED == p_cfg->temp_sensor)
        {
            S12AD.ADEXICR.BIT.TSSA = 1;     // select temperature output GroupA
            S12AD.ADEXICR.BIT.TSSB = 0;
            S12AD.ADGCEXCR.BIT.TSSC = 0;
        }
        else if (ADC_TEMP_SENSOR_AD_CONVERTED_GROUPB == p_cfg->temp_sensor)
        {
            S12AD.ADEXICR.BIT.TSSA = 0;
            S12AD.ADEXICR.BIT.TSSB = 1;     // select temperature output GroupB
            S12AD.ADGCEXCR.BIT.TSSC = 0;
        }
        else
        {
            S12AD.ADEXICR.BIT.TSSA = 0;
            S12AD.ADEXICR.BIT.TSSB = 0;
            S12AD.ADGCEXCR.BIT.TSSC = 1;    // select temperature output GroupC
        }
    }

