renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
    if ((p_cmpwin->compare_mask & ADC_MASK_SENSORS) && (true == p_cmpwin->windowb_enable))
    {
        return ADC_ERR_INVALID_ARG;
    }

    if (((ADC_COMP_WINB_TEMP == p_cmpwin->compare_maskb ) || (ADC_COMP_WINB_VOLT == p_cmpwin->compare_maskb))
    && (true == p_cmpwin->windowa_enable))
    {
        return ADC_ERR_INVALID_ARG;
    }
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */

    if (1 == p_regs->ADCSR.BIT.TRGE)
    {
        return ADC_ERR_TRIG_ENABLED;    // ADST must be 0 to configure comparator
    }

    /* CONFIGURE COMPARATOR */
    if (true == p_cmpwin->windowa_enable) // COMPARATOR A
    {
        p_regs->ADCMPCR.BIT.CMPAE = 0;
        
        p_regs->ADCMPDR0 = p_cmpwin->level_lo;
        
        if (1 == p_regs->ADCMPCR.BIT.WCMPE)
        {
            p_regs->ADCMPDR1 = p_cmpwin->level_hi;
        }

        /* Cast to match the register type */
        p_regs->ADCMPANSR0.WORD = (uint16_t)(p_cmpwin->compare_mask & (~ADC_MASK_SENSORS));

        /* Cast to match the register type */
        p_regs->ADCMPLR0.WORD = (uint16_t)(p_cmpwin->inside_window_mask & (~ADC_MASK_SENSORS));

        tmp_adcmpansr1 = (p_cmpwin->compare_mask & (~ADC_MASK_SENSORS));

        /* Cast to match the register type */
        S12AD.ADCMPANSR1.WORD = (uint16_t)(tmp_adcmpansr1 >> 16);
        S12AD.ADCMPANSER.BIT.CMPSTS = (p_cmpwin->compare_mask & ADC_MASK_TEMP) ? 1 : 0;
        S12AD.ADCMPANSER.BIT.CMPSOC = (p_cmpwin->compare_mask & ADC_MASK_VOLT) ? 1 : 0;

        tmp_adcmpansl1 = (p_cmpwin->compare_mask & (~ADC_MASK_SENSORS));

        /* Cast to match the register type */
        S12AD.ADCMPLR1.WORD = (uint16_t)(tmp_adcmpansl1 >> 16);
        S12AD.ADCMPLER.BIT.CMPLTS = (p_cmpwin->inside_window_mask & ADC_MASK_TEMP) ? 1 : 0;
        S12AD.ADCMPLER.BIT.CMPLOC = (p_cmpwin->inside_window_mask & ADC_MASK_VOLT) ? 1 : 0;

        p_regs->ADCMPCR.BIT.CMPAE = 1;
    }
    else
    {
        p_regs->ADCMPCR.BIT.CMPAE = 0;
    }

    if (true == p_cmpwin->windowb_enable) // COMPARATOR B
    {
        p_regs->ADCMPCR.BIT.CMPBE = 0;

        p_regs->ADWINLLB = p_cmpwin->level_lob;

        if (1 == p_regs->ADCMPCR.BIT.WCMPE)
        {
            p_regs->ADWINULB = p_cmpwin->level_hib;
        }
        
        p_regs->ADCMPBNSR.BIT.CMPCHB = p_cmpwin->compare_maskb & 0x3F;
        p_regs->ADCMPBNSR.BIT.CMPLB = p_cmpwin->inside_window_maskb;

        p_regs->ADCMPCR.BIT.CMPBE = 1;
    }
    else
    {
        p_regs->ADCMPCR.BIT.CMPBE = 0;
    }

    /* Window A/B Composite Conditions Setting */

    if ((true == p_cmpwin->windowa_enable) && (true == p_cmpwin->windowb_enable))
    {
        p_regs->ADCMPCR.BIT.CMPAB = p_cmpwin->comp_cond;
    }

    /* ENABLE INTERRUPT */
    /* Clear interrupt subvector flag and set callback */
    if (0 != p_cmpwin->int_priority)
    {

        /* Cast from uint8_t to uint32_t */
        group_priority.ipl = (uint32_t)(p_cmpwin->int_priority);

        if (true == p_cmpwin->windowa_enable) // COMPARATOR A
        {
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPAI, adc_s12cmpia0_isr);
            p_regs->ADCMPCR.BIT.CMPAIE = 1;             // enable interrupt in ADC
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
            ICU.GENBL1.LONG |= g_dcb.cmpi_mask;   // enable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
            R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPAI,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
        }

        if (true == p_cmpwin->windowb_enable) // COMPARATOR B
        {
            R_BSP_InterruptWrite(BSP_INT_SRC_BL1_S12AD0_S12CMPBI, adc_s12cmpib0_isr);
            p_regs->ADCMPCR.BIT.CMPBIE = 1;             // enable interrupt in ADC
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
            ICU.GENBL1.LONG |= g_dcb.cmpi_maskb;   // enable group subvector
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
            R_BSP_InterruptControl(BSP_INT_SRC_BL1_S12AD0_S12CMPBI,

                                        /* Cast to match the argument type */
                                        BSP_INT_CMD_GROUP_INTERRUPT_ENABLE, (void *) &group_priority);
        }
    }

    /* Do NOT enable GENBL1, CMPIAE or CMPIBE here with the intention of polling the GRPBL1 bit
     * for condition met. Another driver may make the GROUPBL1 priority non-zero
     * and there will be no subvector interrupt/callback here to clear the ICU flag.
     * The result will be that the BSP will be in an "infinite loop" processing the
     * group interrupt because the flag never resets, and the app level will not run.
     */

    return ADC_SUCCESS;
} /* End of function adc_en_comparator_level0() */


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flags
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                    Unit number (0, 1 or 2)
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flags(uint8_t unit)
{
    volatile uint32_t    flags;
    uint32_t tmp_flags;
    aregs_t     *p_regs;

