renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
    /* NOTE: S12CMPAI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPAI interrupt does not replace it but is in addition to it.
     */

    /* Get S12AD register address */
    p_regs = (aregs_t *)&S12AD;

    /* Cast to match variable type */
    flags = (uint32_t)p_regs->ADCMPSR0.WORD;
    p_regs->ADCMPSR0.WORD = 0;

    if (0 == p_regs->ADCMPSR0.WORD)
    {
        R_BSP_NOP();
    }

    /* Cast to match variable type */
    tmp_flags = (((uint32_t)p_regs->ADCMPSR1.WORD) << 16);
    flags |= tmp_flags;
    p_regs->ADCMPSR1.WORD = 0;

    if (0 == p_regs->ADCMPSR1.WORD)
    {
        R_BSP_NOP();
    }

    if (1 == p_regs->ADCMPSER.BIT.CMPFTS)
    {
        flags |= ADC_MASK_TEMP;
    }

    if (1 == p_regs->ADCMPSER.BIT.CMPFOC)
    {
        flags |= ADC_MASK_VOLT;
    }

    p_regs->ADCMPSER.BYTE = 0;

    if (0 == p_regs->ADCMPSER.BYTE)
    {
        R_BSP_NOP();
    }

    return flags;
} /* End of function adc_get_and_clr_cmpi_flags() */


/*****************************************************************************
* Function Name: adc_get_and_clr_cmpi_flagsb
* Description  : Returns flags for all channels/sensors that met comparator
*                condition and clears the flags for next interrupt.
* Arguments    : unit -
*                    Unit number (0, 1 or 2)
* Return Value : channels/sensors that met comparator condition
******************************************************************************/
static uint32_t adc_get_and_clr_cmpi_flagsb(uint8_t unit)
{
    volatile uint32_t    flags;
    aregs_t     *p_regs;

    /* NOTE: S12CMPBI interrupts are level-based, not edge, so there will be
     * continuous triggers while condition is met. Writing 0 to the flags has
     * no effect UNTIL the condition clears.
     *
     * Also, the data register for the channel/sensor will still be written to.
     * The S12CMPBI interrupt does not replace it but is in addition to it.
     */

    /* Get S12AD register address */
    p_regs = (aregs_t *)&S12AD;

    /* Cast to match variable type */
    flags = (uint32_t)p_regs->ADCMPBSR.BIT.CMPSTB;
    p_regs->ADCMPBSR.BIT.CMPSTB = 0;
    if (0 == p_regs->ADCMPBSR.BIT.CMPSTB)
    {
        R_BSP_NOP();
    }

    return flags;
} /* End of function adc_get_and_clr_cmpi_flagsb() */


/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
static adc_err_t adc_configure_scan(uint8_t const   unit,
                                    adc_ch_cfg_t   *p_config)
{

    /* Get S12AD register address */
    aregs_t     *p_regs = (aregs_t *)&S12AD;
    uint32_t  i;
    volatile uint32_t  tmp_mask=0;
    volatile uint16_t  trig_a;
    volatile uint16_t  trig_b;
    volatile uint16_t  trig_c;
    volatile uint8_t   tmp_adscs[ADC_0_REG_ARRAY_MAX];
    volatile uint32_t  conv_order_cnt;
    volatile uint32_t  bit_cnt;
    volatile uint32_t  tmp_adansa;
    volatile uint32_t  tmp_adansa_invert;

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(unit, p_config);
    if (ADC_SUCCESS != err)
    {
        return err;
    }

#endif /* parameter checking */

    /* SET MASKS FOR CHANNELS AND SENSORS */

    /* Cast to match the register type */
    p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x0FFF);

    /* Cast to match the register type */
    p_regs->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x0FFF);

    /* Cast to match the register type */
    S12AD.ADANSA1.WORD = (uint16_t) ((p_config->chan_mask >> 16) & 0x00ff);

    /* Cast to match the register type */
    S12AD.ADANSB1.WORD = (uint16_t) ((p_config->chan_mask_groupb >> 16) & 0x00ff);

    /* Cast to match the register type */
    S12AD.ADANSC1.WORD = (uint16_t) ((p_config->chan_mask_groupc >> 16) & 0x00ff);

    /* Cast to match the register type */
    S12AD.ADADS1.WORD = (uint16_t) ((p_config->add_mask >> 16) & 0x00ff);

    adc_configure_sensors(p_config);

    /* SET ORDER OF CHANNEL CONVERSION */
    tmp_adansa = 0;
    tmp_adansa |= (p_config->chan_mask & 0x00030FFF);
    tmp_adansa |= (p_config->chan_mask_groupb & 0x00030FFF);
    tmp_adansa |= (p_config->chan_mask_groupc & 0x00030FFF);
    tmp_adansa_invert = ((~tmp_adansa) & 0x00030FFF);

    bit_cnt = 0;
    conv_order_cnt = 0;

    /* WAIT_LOOP */
    for (i= 0x00000001; i<0x00040000; i<<=1)
    {
        if (0 != (tmp_adansa & i))
        {
            bit_cnt++;
        }
    }

    /* WAIT_LOOP */
    for (i=bit_cnt; i<ADC_0_REG_ARRAY_MAX; i++)
    {

        /* WAIT_LOOP */
        while (conv_order_cnt<32)
        {
            if (1 == (tmp_adansa_invert & 0x00000001))
            {
                tmp_adscs[i] = conv_order_cnt;
                tmp_adansa_invert >>= 1;
                conv_order_cnt++;
                break;
            }

