renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
            tmp_adansa_invert >>= 1;
            conv_order_cnt++;
        }
    }

    conv_order_cnt = 0;

    if (ADC_CONV_ORDER_MANUAL_SETTING == p_config->conv_order_status)
    {

        /* WAIT_LOOP */
        for (i=0; i<bit_cnt; i++)
        {
            tmp_adscs[i] = 0;
            conv_order_cnt = p_config->conversion_order[i];

            /* WAIT_LOOP */
            while (conv_order_cnt > 1)
            {
                tmp_adscs[i]++;
                conv_order_cnt >>= 1;
            }
        }
    }
    else
    {

        /* WAIT_LOOP */
        for (i=0; i<bit_cnt; i++)
        {

            /* WAIT_LOOP */
            while (conv_order_cnt<32)
            {
                if (1 == (tmp_adansa & 0x00000001))
                {
                    tmp_adscs[i] = conv_order_cnt;
                    tmp_adansa >>= 1;
                    conv_order_cnt++;
                    break;
                }

                tmp_adansa >>= 1;
                conv_order_cnt++;
            }
        }
    }

    /* Set ADSCSn Register */
    p_regs->ADSCS0 = tmp_adscs[0];
    p_regs->ADSCS1 = tmp_adscs[1];
    p_regs->ADSCS2 = tmp_adscs[2];
    p_regs->ADSCS3 = tmp_adscs[3];
    p_regs->ADSCS4 = tmp_adscs[4];
    p_regs->ADSCS5 = tmp_adscs[5];
    p_regs->ADSCS6 = tmp_adscs[6];
    p_regs->ADSCS7 = tmp_adscs[7];

    if (2 == unit)
    {
        p_regs->ADSCS8  = tmp_adscs[8];
        p_regs->ADSCS9  = tmp_adscs[9];
        p_regs->ADSCS10 = tmp_adscs[10];
        p_regs->ADSCS11 = tmp_adscs[11];
        p_regs->ADSCS12 = tmp_adscs[12];
        p_regs->ADSCS13 = tmp_adscs[13];
    }

    /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */
    if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
    {
        trig_a = p_regs->ADSTRGR.BIT.TRSA;              // save TRSA
        trig_b = p_regs->ADSTRGR.BIT.TRSB;              // save TRSB
        trig_c = p_regs->ADGCTRGR.BIT.TRSC;             // save TRSC
        p_regs->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
        p_regs->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
        p_regs->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
        {
            R_BSP_NOP();
        }

        p_regs->ADGSPCR.WORD = p_config->priority_groupa;

        p_regs->ADSTRGR.BIT.TRSA = trig_a;           // restore TRSA

        if (0 == p_regs->ADGSPCR.BIT.GBRP)
        {
            p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
            p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
        }
        else
        {
            if (0 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
            }
            else
            {
                p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
            }
        }
    }
    else
    {
        p_regs->ADGSPCR.WORD = p_config->priority_groupa;
    }

    /* SET SELF DIAGNOSIS REGISTERS (VIRTUAL CHANNEL) */
    if (ADC_DIAG_OFF == p_config->diag_method)
    {
        p_regs->ADCER.BIT.DIAGM = 0;
    }
    else
    {

        /* NOTE: Using Self Diagnosis adds 11/13/15(resolution) + (ch0 SST) ADCLKS to scan time. */
        /* (ch0 can still be used with self diagnosis on) */
        if (ADC_DIAG_ROTATE_VOLTS == p_config->diag_method)
        {
            p_regs->ADCER.BIT.DIAGLD = 0;
            p_regs->ADCER.BIT.DIAGVAL = 1;
        }
        else
        {
            p_regs->ADCER.BIT.DIAGLD = 1;
            p_regs->ADCER.BIT.DIAGVAL = (uint8_t)(p_config->diag_method & 0x3);   // 2-bit value;
        }
        p_regs->ADCER.BIT.DIAGM = 1;
    }

    /* SET DOUBLE TRIGGER CHANNEL */
    if (1 == p_regs->ADCSR.BIT.DBLE)
    {
        i = 0;
        tmp_mask = p_config->chan_mask;         // tmp_mask is non-Group/Group A chans

        /* WAIT_LOOP */
        while (tmp_mask >>= 1)                  // determine bit/ch number
        {
            i++;
        }
        p_regs->ADCSR.BIT.DBLANS = i;
    }

    p_regs->ADELCCR.BIT.ELCC = p_config->signal_elc;

    /* ENABLE INTERRUPTS */
    adc_enable_s12adi(unit);
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        adc_enable_s12gbadi(unit);
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            adc_enable_s12gcadi(unit);
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_configure_scan() */


/******************************************************************************
* Function Name: adc_check_scan_config
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode.
*
* NOTE: A negative number is stored in two's complement form.
*       A quick way to change a binary number into two's complement is to
*       start at the right (LSB) and moving left, don't change any bits
*       until after the first "1" is reached.
*       Number          2's complement
*       0010 0110       1101 1010
*       Another way is to do a 1's complement on the number, then add 1 to that.
*       Number          1's complement  + 1
*       0010 0110       1101 1001       1101 1010
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_scan_config(uint8_t const   unit,
                                        adc_ch_cfg_t   *p_config)
{
    volatile uint32_t    i = 0;
    uint32_t    tmp_mask = 0;
    volatile uint32_t    a_mask;
    volatile uint32_t    b_mask;
    volatile uint32_t    c_mask;
    volatile uint32_t    tmp_adcsr;
    volatile uint32_t    tmp_adansa;
    volatile uint32_t    bit_cnt;

    /* Get S12AD register address */
    aregs_t     *p_regs = (aregs_t *)&S12AD;

    /* Verify at least one bonded channel is selected */
    if ((0 == p_config->chan_mask)
    || ((p_config->chan_mask & ADC_PRV_INVALID_CH_MASK0) != 0))
    {
        return ADC_ERR_INVALID_ARG;
    }

