renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
    /* Verify at least one unique bonded channel is selected for Group B
     * and GroupA priority setting is valid.
     */
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        if ((0 == p_config->chan_mask_groupb)
        || ((p_config->chan_mask_groupb & ADC_PRV_INVALID_CH_MASK0) != 0))
        {
            return ADC_ERR_INVALID_ARG;
        }
        else if ((p_config->chan_mask & p_config->chan_mask_groupb) != 0)
        {
            return ADC_ERR_ILLEGAL_ARG;         // same chan in both groups
        }
        else
        {
            tmp_mask = p_config->chan_mask_groupb;
        }

        if (1 == p_regs->ADGCTRGR.BIT.GRCE) // for Group C
        {
            if ((0 == p_config->chan_mask_groupc)
            || ((p_config->chan_mask_groupc & ADC_PRV_INVALID_CH_MASK0) != 0))
            {
                return ADC_ERR_INVALID_ARG;
            }
            else if (((p_config->chan_mask & p_config->chan_mask_groupb)
            || (p_config->chan_mask & p_config->chan_mask_groupc)
            || (p_config->chan_mask_groupb & p_config->chan_mask_groupc)) != 0)
            {
                return ADC_ERR_ILLEGAL_ARG;         // same chan in three groups
            }
            else
            {
                tmp_mask |= p_config->chan_mask_groupc;
            }
        }
    }
    else
    {

        /* for addition mask checking */
        if ((0 != p_config->chan_mask_groupb) || (0 != p_config->chan_mask_groupc))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* PGS bit must be set when group scan mode */
        if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }

    /* Confirm that the temperature sensor settings of R_ADC_Open function and R_ADC_Control function match. */
    if ((((p_regs->ADEXICR.WORD & 0x0100) != 0) && ((p_config->chan_mask & ADC_MASK_TEMP) == 0))
    || (((p_regs->ADEXICR.WORD & 0x0100) == 0) && ((p_config->chan_mask & ADC_MASK_TEMP) != 0)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    if ((((p_regs->ADEXICR.WORD & 0x0400) != 0) && ((p_config->chan_mask_groupb & ADC_MASK_TEMP) == 0))
    || (((p_regs->ADEXICR.WORD & 0x0400) == 0) && ((p_config->chan_mask_groupb & ADC_MASK_TEMP) != 0)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    if ((((p_regs->ADGCEXCR.BYTE & 0x01) != 0) && ((p_config->chan_mask_groupc & ADC_MASK_TEMP) == 0))
    || (((p_regs->ADGCEXCR.BYTE & 0x01) == 0) && ((p_config->chan_mask_groupc & ADC_MASK_TEMP) != 0)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    if ((((p_regs->ADEXICR.WORD & 0x0001) != 0) && ((p_config->add_mask & ADC_MASK_TEMP) == 0))
    || (((p_regs->ADEXICR.WORD & 0x0001) == 0) && ((p_config->add_mask & ADC_MASK_TEMP) != 0)))
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    /* If sensors specified, verify in legal configuration */
    if ((p_config->chan_mask & ADC_MASK_SENSORS)
    || (p_config->chan_mask_groupb & ADC_MASK_SENSORS)
    || (p_config->chan_mask_groupc & ADC_MASK_SENSORS))
    {
        if (
        (1 == S12AD.ADCSR.BIT.DBLE)         // double trigger mode
        || (0 != (S12AD.ADDISCR.BYTE & 0x0F))  // disconnect detection assist enabled
        || (ADC_ADCS_CONT_SCAN == S12AD.ADCSR.BIT.ADCS)   // continuous scan mode
        || (ADC_DIAG_OFF != p_config->diag_method))        // self-diagnosis
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    /* When A/D conversion is performed for the temperature sensor output or 
       internal reference voltage, do not select analog input channels. */
    if (p_config->chan_mask & ADC_MASK_SENSORS)
    {
        if (0 != (p_config->chan_mask & (~ADC_MASK_SENSORS)))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        if (p_config->chan_mask_groupb & ADC_MASK_SENSORS)
        {
            if (0 != (p_config->chan_mask_groupb & (~ADC_MASK_SENSORS)))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }

        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            if (p_config->chan_mask_groupc & ADC_MASK_SENSORS)
            {
                if (0 != (p_config->chan_mask_groupc & (~ADC_MASK_SENSORS)))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
        }
    }

    /* Addition mask should not include bits from inactive channels */
    if (ADC_ADD_OFF != p_regs->ADADC.BIT.ADC)
    {
        tmp_mask |= p_config->chan_mask;        // tmp_mask is Group A and B and C combined

        /* Bit-AND with 1s-complement */
        if ((p_config->add_mask & (~tmp_mask)) != 0)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }
    else
    {

        /* WARNING! Other features messed up if add_mask is non-zero when addition is turned off!*/
        p_config->add_mask = 0;
    }

    /* Verify only 1 bit is set in default/Group A mask */

    if ((ADC_MODE_SS_ONE_CH == g_dcb.mode)
    || (ADC_MODE_CONT_ONE_CH == g_dcb.mode)
    || (1 == p_regs->ADCSR.BIT.DBLE))          // double trigger mode
    {
        tmp_mask = p_config->chan_mask;         // tmp_mask is non-Group/Group A chans

        /* Bit-AND with 2s-complement (see note in function header) */
        if ((tmp_mask & ((~tmp_mask) + 1)) != tmp_mask)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    if ((ADC_DIAG_OFF != p_config->diag_method)
    &&   ((0 != p_regs->ADADC.BIT.ADC)           // addition
        || (1 == p_regs->ADCSR.BIT.DBLE)          // double trigger mode
        || (1 == p_regs->ADCMPCR.BIT.CMPAE)       // comparator A
        || (1 == p_regs->ADCMPCR.BIT.CMPBE)       // comparator B
        || (0 != (p_regs->ADDISCR.BYTE & 0x0F)))) // disconnect detection assist
    {
        return ADC_ERR_ILLEGAL_ARG;
    }

    /* Parameter check of the order of channel conversion */
    if (ADC_CONV_ORDER_MANUAL_SETTING == p_config->conv_order_status)
    {
        tmp_mask = 0;

        /* WAIT_LOOP */
        for (i=0; i<ADC_0_REG_ARRAY_MAX; i++)    /* 0-23 */
        {

