renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
            /* Macro definition must be used for parameter setting. */
            /* Temperature sensors can not be used. */
            /* Internal reference voltage can not be used. */
            if ((ADC_MASK_CH0 != p_config->conversion_order[i])
            && (ADC_MASK_CH1 != p_config->conversion_order[i])
            && (ADC_MASK_CH2 != p_config->conversion_order[i])
            && (ADC_MASK_CH3 != p_config->conversion_order[i])
            && (ADC_MASK_CH4 != p_config->conversion_order[i])
            && (ADC_MASK_CH5 != p_config->conversion_order[i])
            && (ADC_MASK_CH6 != p_config->conversion_order[i])
            && (ADC_MASK_CH7 != p_config->conversion_order[i])
            && (ADC_MASK_CH8 != p_config->conversion_order[i])
            && (ADC_MASK_CH9 != p_config->conversion_order[i])
            && (ADC_MASK_CH10 != p_config->conversion_order[i])
            && (ADC_MASK_CH11 != p_config->conversion_order[i])
            && (ADC_MASK_CH12 != p_config->conversion_order[i])
            && (ADC_MASK_CH13 != p_config->conversion_order[i])
            && (ADC_MASK_CH14 != p_config->conversion_order[i])
            && (ADC_MASK_CH15 != p_config->conversion_order[i])
            && (ADC_MASK_CH16 != p_config->conversion_order[i])
            && (ADC_MASK_CH17 != p_config->conversion_order[i])
            && (ADC_MASK_CH18 != p_config->conversion_order[i])
            && (ADC_MASK_CH19 != p_config->conversion_order[i])
            && (ADC_MASK_CH20 != p_config->conversion_order[i])
            && (ADC_MASK_CH21 != p_config->conversion_order[i])
            && (ADC_MASK_CH22 != p_config->conversion_order[i])
            && (ADC_MASK_CH23 != p_config->conversion_order[i])
            && (ADC_MASK_CONV_ORDER_OFF != p_config->conversion_order[i]))
            {
                return ADC_ERR_ILLEGAL_ARG;
            }

            tmp_mask |= p_config->conversion_order[i];
        }

        /* Invalid channels should not be used. */
        if (0 != (tmp_mask & ADC_PRV_INVALID_CH_MASK0))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* Only the channels specified to 1 (enable) in the A/D channel select register such as
           the ADANSA0/1, ADANSB0/1, and ADANSC0/1 registers should be used */
        /* All channels specified to 1 (enable) in the A/D channel select register such as
           the ADANSA0/1, ADANSB0/1, and ADANSC0/1 registers should be used. */
        tmp_adansa = 0;

        tmp_adansa |= (p_config->chan_mask & 0x00030FFF);
        tmp_adansa |= (p_config->chan_mask_groupb & 0x00030FFF);
        tmp_adansa |= (p_config->chan_mask_groupc & 0x00030FFF);

        if (tmp_mask != tmp_adansa)
        {
            return ADC_ERR_ILLEGAL_ARG;
        }

        /* Should be set ADC_MASK_CONV_ORDER_OFF to not used ADSCSn register. */
        bit_cnt = 0;

        /* WAIT_LOOP */
        for (i= 0x00000001; i<0x00040000; i<<=1)
        {
            if (0 != (tmp_mask & i))
            {
                bit_cnt++;
            }
        }

        /* WAIT_LOOP */
        for (i=bit_cnt; i<ADC_0_REG_ARRAY_MAX; i++)
        {
            if (ADC_MASK_CONV_ORDER_OFF != p_config->conversion_order[i])
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_check_scan_config() */
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */


/******************************************************************************
* Function Name: adc_configure_sensors
* Description  : This function set the sensor bits taking into account group
*                inclusion and addition/average mode.
* Arguments    : p_config -
*                   The configuration argument passed to ADC_CMD_ENABLE_CHANS.
* Return Value : none
*******************************************************************************/
static void adc_configure_sensors(adc_ch_cfg_t   *p_config)
{

    /* TEMPERATURE SENSOR */
    if ((p_config->chan_mask & ADC_MASK_TEMP)
    || (p_config->chan_mask_groupb & ADC_MASK_TEMP)
    || (p_config->chan_mask_groupc & ADC_MASK_TEMP))
    {

        /* Waiting time for sensors stabilization. 
           Stabilization time * margin = 200us * 1.1 = 220us  */
        R_BSP_SoftwareDelay(220, BSP_DELAY_MICROSECS);
    }

    /* INTERNAL REFERENCE VOLTAGE SENSOR */
    if ((p_config->chan_mask & ADC_MASK_VOLT)
    || (p_config->chan_mask_groupb & ADC_MASK_VOLT)
    || (p_config->chan_mask_groupc & ADC_MASK_VOLT))
    {
        S12AD.ADEXICR.BIT.OCSA = 0;
        S12AD.ADEXICR.BIT.OCSB = 0;
        S12AD.ADGCEXCR.BIT.OCSC = 0;

        S12AD.ADVMONCR.BIT.VDE = 1;
        S12AD.ADVMONO.BIT.VDO = 1;

        if (p_config->chan_mask & ADC_MASK_VOLT)
        {
            S12AD.ADEXICR.BIT.OCSA = 1;            // select temperature output to GroupA
            S12AD.ADEXICR.BIT.OCSB = 0;
            S12AD.ADGCEXCR.BIT.OCSC = 0;
        }
        else if (p_config->chan_mask_groupb & ADC_MASK_VOLT)
        {
            S12AD.ADEXICR.BIT.OCSA = 0;
            S12AD.ADEXICR.BIT.OCSB = 1;            // select temperature output to GroupB
            S12AD.ADGCEXCR.BIT.OCSC = 0;
        }
        else
        {
            S12AD.ADEXICR.BIT.OCSA = 0;
            S12AD.ADEXICR.BIT.OCSB = 0;
            S12AD.ADGCEXCR.BIT.OCSC = 1;           // select temperature output to GroupC
        }

        S12AD.ADEXICR.BIT.OCSAD = (p_config->add_mask & ADC_MASK_VOLT) ? 1 : 0;

        /* Waiting time for sensors stabilization.
           Stabilization time * margin = 400ns * 1.1 = 440ns
           The minimum wait time of R_BSP_SoftwareDelay is 1 us. */
        R_BSP_SoftwareDelay(1, BSP_DELAY_MICROSECS);
    }

    return;
} /* End of function adc_configure_sensors() */


/******************************************************************************
* Function Name: adc_enable_s12adi
* Description  : This function clears the S12ADI interrupt flag and enables
*                interrupts in the peripheral (for IR flag usage). If priority
*                is not 0, interrupts are enabled in the ICU.
*                NOTE: This has nothing to do with enabling triggers.
* Arguments    : unit -
*                   0 or 1
* Return Value : none
*******************************************************************************/
static void adc_enable_s12adi(uint8_t unit)
{
    IR(S12ADC0,S12ADI0) = 0;            // clear flag
    S12AD.ADCSR.BIT.ADIE = 1;           // enable in peripheral
    if (0 != IPR(S12ADC0,S12ADI0))
    {
        R_BSP_InterruptRequestEnable(VECT(S12ADC0,S12ADI0));       // enable in ICU
    }

} /* End of function adc_enable_s12adi() */


