renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx660/r_s12ad_rx660.c
    return ADC_SUCCESS;
} /* End of function adc_close() */

/******************************************************************************
* Function Name: adc_read_all
* Description  : This is implementation of R_ADC_ReadAll().
*                It reads conversion results from all potential sources,
*                enabled or not.
* Arguments    : p_data-
*                    Pointer to structure to load register values into.
* Return Value : ADC_SUCCESS-
*                    Successful
*******************************************************************************/
adc_err_t adc_read_all(adc_data_t * const  p_all_data)
{
    p_all_data->unit0.chan[ADC_REG_CH0]   = S12AD.ADDR0;
    p_all_data->unit0.chan[ADC_REG_CH1]   = S12AD.ADDR1;
    p_all_data->unit0.chan[ADC_REG_CH2]   = S12AD.ADDR2;
    p_all_data->unit0.chan[ADC_REG_CH3]   = S12AD.ADDR3;
    p_all_data->unit0.chan[ADC_REG_CH4]   = S12AD.ADDR4;
    p_all_data->unit0.chan[ADC_REG_CH5]   = S12AD.ADDR5;
    p_all_data->unit0.chan[ADC_REG_CH6]   = S12AD.ADDR6;
    p_all_data->unit0.chan[ADC_REG_CH7]   = S12AD.ADDR7;
    p_all_data->unit0.chan[ADC_REG_CH8]   = S12AD.ADDR8;
    p_all_data->unit0.chan[ADC_REG_CH9]   = S12AD.ADDR9;
    p_all_data->unit0.chan[ADC_REG_CH10]  = S12AD.ADDR10;
    p_all_data->unit0.chan[ADC_REG_CH11]  = S12AD.ADDR11;
    p_all_data->unit0.chan[ADC_REG_CH12]  = S12AD.ADDR12;
    p_all_data->unit0.chan[ADC_REG_CH13]  = S12AD.ADDR13;
    p_all_data->unit0.chan[ADC_REG_CH14]  = S12AD.ADDR14;
    p_all_data->unit0.chan[ADC_REG_CH15]  = S12AD.ADDR15;
    p_all_data->unit0.chan[ADC_REG_CH16]  = S12AD.ADDR16;
    p_all_data->unit0.chan[ADC_REG_CH17]  = S12AD.ADDR17;
    p_all_data->unit0.chan[ADC_REG_CH18]  = S12AD.ADDR18;
    p_all_data->unit0.chan[ADC_REG_CH19]  = S12AD.ADDR19;
    p_all_data->unit0.chan[ADC_REG_CH20]  = S12AD.ADDR20;
    p_all_data->unit0.chan[ADC_REG_CH21]  = S12AD.ADDR21;
    p_all_data->unit0.chan[ADC_REG_CH22]  = S12AD.ADDR22;
    p_all_data->unit0.chan[ADC_REG_CH23]  = S12AD.ADDR23;
    p_all_data->unit0.temp                = S12AD.ADTSDR;
    p_all_data->unit0.volt                = S12AD.ADOCDR;
    p_all_data->unit0.dbltrig             = S12AD.ADDBLDR;
    p_all_data->unit0.dbltrigA            = S12AD.ADDBLDRA;
    p_all_data->unit0.dbltrigB            = S12AD.ADDBLDRB;
    p_all_data->unit0.self_diag           = S12AD.ADRD.WORD;

    return ADC_SUCCESS;
} /* End of function adc_read_all() */


/*****************************************************************************
* Function Name: adc_s12cmpia0_isr
* Description  : Unit0 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpia0_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_MET;
        args.compare_flags = adc_get_and_clr_cmpi_flags(0);
        g_dcb.p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flags(0);
    }
} /* End of function adc_s12cmpia0_isr() */


/*****************************************************************************
* Function Name: adc_s12cmpib0_isr
* Description  : Unit0 interrupt handler (bsp GRPBL1 callback) for comparator.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void adc_s12cmpib0_isr(void *cb_args)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {

        /* NOTE: S12CMPI interrupts are level-based, not edge, so there will be
         * continuous triggers while condition is met. When the condition is no
         * longer met, both the ICU.GRPBL1 flag and subvector flag are
         * automatically cleared.
         */
        args.event = ADC_EVT_CONDITION_METB;
        args.compare_flagsb = adc_get_and_clr_cmpi_flagsb(0);
        g_dcb.p_callback(&args);
    }
    else
    {
        adc_get_and_clr_cmpi_flagsb(0);
    }
} /* End of function adc_s12cmpib0_isr() */

/*****************************************************************************
* Function Name: adc_s12adi0_isr
* Description  : Unit0 interrupt handler for normal/Group A/double trigger
*                scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12adi0_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE;
        g_dcb.p_callback(&args);
    }
} /* End of function adc_s12adi0_isr() */

/*****************************************************************************
* Function Name: adc_s12gbadi0_isr
* Description  : Unit0 interrupt handler for Group B scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12gbadi0_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPB;
        g_dcb.p_callback(&args);
    }
} /* End of function adc_s12gbadi0_isr() */

/*****************************************************************************
* Function Name: adc_s12gcadi0_isr
* Description  : Unit0 interrupt handler for Group C scan complete.
* Arguments    : none
* Return Value : none
******************************************************************************/
R_BSP_ATTRIB_STATIC_INTERRUPT void adc_s12gcadi0_isr(void)
{
    adc_cb_args_t   args;

    if ((NULL != g_dcb.p_callback) && (FIT_NO_FUNC != g_dcb.p_callback))
    {
        args.event = ADC_EVT_SCAN_COMPLETE_GROUPC;
        g_dcb.p_callback(&args);
    }
} /* End of function adc_s12gcadi0_isr() */

#endif /* #if defined BSP_MCU_RX660 */

